{"class_name": "Model", "keras_version": "1.1.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000], "input_dtype": "int32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Embedding", "config": {"trainable": false, "name": "embedding_1", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 20001, "batch_input_shape": [null, 1000], "W_regularizer": null, "dropout": 0.0, "output_dim": 100, "input_length": 1000}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "embedding_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_1", "activity_regularizer": null, "trainable": true, "filter_length": 5, "init": "glorot_uniform", "bias": true, "nb_filter": 128, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "convolution1d_1"}, {"class_name": "MaxPooling1D", "config": {"stride": 5, "pool_length": 5, "trainable": true, "name": "maxpooling1d_1", "border_mode": "valid"}, "inbound_nodes": [[["convolution1d_1", 0, 0]]], "name": "maxpooling1d_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_2", "activity_regularizer": null, "trainable": true, "filter_length": 5, "init": "glorot_uniform", "bias": true, "nb_filter": 128, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["maxpooling1d_1", 0, 0]]], "name": "convolution1d_2"}, {"class_name": "MaxPooling1D", "config": {"stride": 5, "pool_length": 5, "trainable": true, "name": "maxpooling1d_2", "border_mode": "valid"}, "inbound_nodes": [[["convolution1d_2", 0, 0]]], "name": "maxpooling1d_2"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_3", "activity_regularizer": null, "trainable": true, "filter_length": 5, "init": "glorot_uniform", "bias": true, "nb_filter": 128, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["maxpooling1d_2", 0, 0]]], "name": "convolution1d_3"}, {"class_name": "MaxPooling1D", "config": {"stride": 35, "pool_length": 35, "trainable": true, "name": "maxpooling1d_3", "border_mode": "valid"}, "inbound_nodes": [[["convolution1d_3", 0, 0]]], "name": "maxpooling1d_3"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["maxpooling1d_3", 0, 0]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 20}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "dense_2"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1"}}